IDEA Open Model
IDEAProgressReport Properties
Compatible with IDEA StatiCa 20.1
The IDEAProgressReport type exposes the following members.
Properties
Name | Description
CurrentProgressAmount
 current progress
CurrentProgressMessage
 some message to pass to the UI of current progress
TotalProgressAmount
 total progress
Top
See Also
Reference
IDEAProgressReport Class
IdeaRS.OpenModel.Message Namespace